# GeometryElement Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryElement Methods
GeometryElement Class See Also
---
The GeometryElement type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from GeometryObject.) |
| GetBoundingBox | Retrieves a box that encloses the geometry element. |
| GetEnumerator | Returns an enumerator that iterates through the collection. |
| GetEnumeratorNG | Returns an enumerator that iterates through the collection. |
| GetHashCode | Gets the integer value of the geometry object as hash code  (Inherited from GeometryObject.) |
| GetTransformed | Returns a transformed copy of the geometry in this element. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
GeometryElement Class
Autodesk.Revit.DB Namespace